---
kind: method
id: M:Autodesk.Revit.DB.ViewSet.GetEnumerator
source: html/e48b252d-9945-8ed8-a806-937173a9b765.htm
---
# Autodesk.Revit.DB.ViewSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.